In [1]:
#concatenate and  combine

In [3]:
import pandas as pd
import numpy as np
from pandas import DataFrame,Series

In [5]:
arr1 = np.arange(9).reshape(3,3)
arr2 = np.arange(9).reshape(3,3)

In [8]:
np.concatenate([arr1,arr2],axis=1)

array([[0, 1, 2, 0, 1, 2],
       [3, 4, 5, 3, 4, 5],
       [6, 7, 8, 6, 7, 8]])

In [16]:
s1 = Series([1,2,3],index= ['X','Y','Z'])

In [17]:
s2 = Series([4,5],index= ['a','b'])

In [18]:
s1

X    1
Y    2
Z    3
dtype: int64

In [19]:
s2

a    4
b    5
dtype: int64

In [22]:
pd.concat([s1,s2])

X    1
Y    2
Z    3
a    4
b    5
dtype: int64

In [23]:
pd.concat([s1,s2],axis=1)

     0    1
X  1.0  NaN
Y  2.0  NaN
Z  3.0  NaN
a  NaN  4.0
b  NaN  5.0

In [24]:
df1 = DataFrame(np.random.rand(4,3),columns=['X','Y','Z'])

In [26]:
df2 = DataFrame(np.random.rand(3,3),columns=['X','Y','A'])

In [27]:
df1

          X         Y         Z
0  0.437170  0.790580  0.998178
1  0.398132  0.736664  0.332985
2  0.075342  0.833620  0.147897
3  0.556744  0.190561  0.946716

In [28]:
df2

          X         Y         A
0  0.691449  0.336168  0.755076
1  0.995509  0.550572  0.805532
2  0.403631  0.234302  0.329012

In [30]:
pd.concat([df1,df2])

          A         X         Y         Z
0       NaN  0.437170  0.790580  0.998178
1       NaN  0.398132  0.736664  0.332985
2       NaN  0.075342  0.833620  0.147897
3       NaN  0.556744  0.190561  0.946716
0  0.755076  0.691449  0.336168       NaN
1  0.805532  0.995509  0.550572       NaN
2  0.329012  0.403631  0.234302       NaN

In [31]:
pd.concat([df1,df2],axis =1 )

          X         Y         Z         X         Y         A
0  0.437170  0.790580  0.998178  0.691449  0.336168  0.755076
1  0.398132  0.736664  0.332985  0.995509  0.550572  0.805532
2  0.075342  0.833620  0.147897  0.403631  0.234302  0.329012
3  0.556744  0.190561  0.946716       NaN       NaN       NaN

In [32]:
#combine

In [34]:
s1 = Series([1,np.nan,3,np.nan],index = ['a','b','c','d'])

In [37]:
s2=Series([1,2,3,4],index=['a','b','c','d'])

In [38]:
s1

a    1.0
b    NaN
c    3.0
d    NaN
dtype: float64

In [39]:
s2

a    1
b    2
c    3
d    4
dtype: int64

In [41]:
s1.combine_first(s2)#s2填充s1

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

In [42]:
df1 = DataFrame({
    'X':[1,np.nan,3,np.nan],
    'Y':[5,np.nan,7,np.nan],
    'Z':[9,np.nan,11,np.nan]
})

In [43]:
df2 =  DataFrame({
    'A':[1,2,3,4],
    'Z':[np.nan,10,np.nan,12],
})

In [44]:
df1

     X    Y     Z
0  1.0  5.0   9.0
1  NaN  NaN   NaN
2  3.0  7.0  11.0
3  NaN  NaN   NaN

In [45]:
df2

   A     Z
0  1   NaN
1  2  10.0
2  3   NaN
3  4  12.0

In [46]:
df1.combine_first(df2)

     A    X    Y     Z
0  1.0  1.0  5.0   9.0
1  2.0  NaN  NaN  10.0
2  3.0  3.0  7.0  11.0
3  4.0  NaN  NaN  12.0